# Question 1

In [2]:
import pandas as pd

First, we import pandas and read the given csv file

In [3]:
# csv must be in the same folder as the notebook
customers = pd.read_csv('customers.csv')

In [4]:
# Checking how the data looks
customers.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain
0,0,1985,Graduation,Married,70951.0,0,0,2013-05-04,66,239,...,554,254,87,54,1,3,4,9,1,0
1,1,1961,Graduation,Single,57091.0,0,0,2014-06-15,0,464,...,64,7,0,37,1,7,3,7,5,0
2,9,1975,Master,Single,46098.0,1,1,2012-08-18,86,57,...,27,0,0,36,4,3,2,2,8,0
3,13,1947,PhD,Widow,25358.0,0,1,2013-07-22,57,19,...,5,0,0,8,2,1,0,3,6,0
4,17,1971,PhD,Married,60491.0,0,1,2013-09-06,81,637,...,237,12,19,76,4,6,11,7,5,0

1. Impute missing values in Income with the mean value but given Education and Marital_Status.

In [5]:
# Imputing with mean given a certain value for Education and Marital status
customers['Income'] = customers.groupby(['Education', 'Marital_Status'])['Income'].transform(lambda x: x.fillna(x.mean()))

In [7]:
# To check if there are nulls
customers.isna().any()

ID                     False
Year_Birth             False
Education              False
Marital_Status         False
Income                 False
Kidhome                False
Teenhome               False
Dt_Customer            False
Recency                False
MntWines               False
MntFruits              False
MntMeatProducts        False
MntFishProducts        False
MntSweetProducts       False
MntGoldProds           False
NumDealsPurchases      False
NumWebPurchases        False
NumCatalogPurchases    False
NumStorePurchases      False
NumWebVisitsMonth      False
Complain               False
dtype: bool

2. Create a new column named DaysSinceEnrollment calculated from Dt_Customer. This new column should contain the number of days since enrollment and must be of type int(int64 or int32). Take 2017-01-01 as a reference for the calculation.

In [18]:
# Creating a new column with the help of pd.to_datettime
ref_date = pd.to_datetime('2017-01-01', format='%Y/%m/%d')
customers['DaysSinceEnrollment'] = (ref_date - pd.to_datetime(customers["Dt_Customer"], format='%Y/%m/%d')).dt.days

3. Create a new column called Generation with the following logic.
* If was born after 1981 (included) - Millenial
* If was born between 1965 (included) and 1981 - GenX
* If was born between 1946 (included) and 1965 - BabyBoomer
* If was born between 1928 (included) and 1946 - Silent
* If was born before 1928 - remove the row

In [19]:
# Creating a list with the different generations
gen = []
for row in customers['Year_Birth']:
  if row >= 1981: gen.append('Millenial')
  elif row >= 1965 and row < 1981: gen.append('GenX')
  elif row >= 1946 and row < 1965: gen.append('BabyBoomer')
  elif row >= 1928 and row < 1946: gen.append('Silent')
  else: gen.append('Remove')

In [20]:
# Adding Generation to the dataframe 
customers['Generation'] = gen

In [21]:
customers[['Generation', 'Year_Birth']]

      Generation  Year_Birth
0      Millenial        1985
1     BabyBoomer        1961
2           GenX        1975
3     BabyBoomer        1947
4           GenX        1971
...          ...         ...
2235        GenX        1972
2236  BabyBoomer        1949
2237        GenX        1978
2238  BabyBoomer        1957
2239   Millenial        1986

[2240 rows x 2 columns]

In [22]:
# Dataframe without people born before 1928
customers_new = customers[customers['Generation'] != 'Remove']

4. Sort the resulting DataFrame by ID, in descending order.

In [23]:
# Sorting the dataframe
customers_new.sort_values(by='ID', ascending=False, inplace=True)

/var/folders/wm/c9ks71w95s35n6j8r61gvcg40000gn/T/ipykernel_28647/3527064638.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_new.sort_values(by='ID', ascending=False, inplace=True)

In [24]:
customers_new.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,MntSweetProducts,MntGoldProds,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,Complain,DaysSinceEnrollment,Generation
2239,11191,1986,Graduation,Divorced,41411.0,0,0,2013-12-07,11,37,...,3,18,1,2,1,4,6,0,1121,Millenial
2238,11188,1957,Graduation,Together,26091.0,1,1,2014-02-25,84,15,...,17,20,3,2,1,3,5,0,1041,BabyBoomer
2237,11187,1978,Basic,Single,26487.0,1,0,2013-05-20,23,2,...,14,23,3,2,1,3,5,0,1322,GenX
2236,11181,1949,PhD,Married,156924.0,0,0,2013-08-29,85,2,...,1,1,0,0,0,0,0,0,1221,BabyBoomer
2235,11178,1972,Master,Single,42394.0,1,0,2014-03-23,69,15,...,1,4,1,1,0,3,7,0,1015,GenX

In [27]:
# Writing to a csv
customers_new.to_csv('Group7_Assignment2_C1_Part1.csv', index=False)